---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerInfo.CutLayerName
source: html/b9a4b8a6-0905-9406-e825-ee5b1b0fe2c9.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.CutLayerName Property

The cut layer name stored in value.

## Syntax (C#)
```csharp
public string CutLayerName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null